src/cf/Documents/Перевод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Перевод</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланыПереводов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Произведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Произведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСимволов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ПланыПереводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыПереводов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Произведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Произведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/Перевод/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	КоличествоСимволов = СтрДлина(Текст);
	Если Пользователь.Пустая() Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ПланыПереводов.Записывать = Истина;
	Движение = Движения.ПланыПереводов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.ПериодПлана = НачалоДня(Дата);
	Движение.Пользователь = Пользователь;
	Движение.Произведение = Произведение;
	Движение.План = КоличествоСимволов;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Перевод.Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перевод.Пользователь) КАК Пользователь,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перевод.Произведение) КАК Произведение,
		|	Перевод.КоличествоСимволов КАК КоличествоСимволов,
		|	ЕСТЬNULL(ПланыПереводовОстатки.ПланОстаток, 0) КАК План,
		|	ЕСТЬNULL(ПланыПереводовОстатки.ПланОстаток, 0) - Перевод.КоличествоСимволов КАК Осталось
		|ИЗ
		|	Документ.Перевод КАК Перевод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланыПереводов.Остатки(
		|				,
		|				(ПериодПлана, Пользователь, Произведение) В
		|					(ВЫБРАТЬ
		|						НАЧАЛОПЕРИОДА(Перевод.Дата, ДЕНЬ) КАК ПериодПлана,
		|						Перевод.Пользователь КАК Пользователь,
		|						Перевод.Произведение КАК Произведение
		|					ИЗ
		|						Документ.Перевод КАК Перевод
		|					ГДЕ
		|						Перевод.Ссылка = &Ссылка)) КАК ПланыПереводовОстатки
		|		ПО (НАЧАЛОПЕРИОДА(Перевод.Дата, ДЕНЬ) = ПланыПереводовОстатки.ПериодПлана)
		|			И Перевод.Пользователь = ПланыПереводовОстатки.Пользователь
		|			И Перевод.Произведение = ПланыПереводовОстатки.Произведение
		|ГДЕ
		|	Перевод.Ссылка = &Ссылка
		|	И ЕСТЬNULL(ПланыПереводовОстатки.ПланОстаток, 0) - Перевод.КоличествоСимволов > 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ШаблонСообщения = нСтр("ru='По произведению %1 для выполнения плана %2
			|от %3 необходимо перевести еще %4 символов'", "ru");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон(ШаблонСообщения,
							Выборка.Произведение,
							Выборка.План,
							Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"),
							Выборка.Осталось);
		Сообщение.Поле = НСтр("ru = 'КоличествоСимволов'", "ru");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЦикла;

	
КонецПроцедуры

#КонецОбласти
